app/controllers/artisan/products_controller.rb

  def create
    @product = current_user.products.new(product_params)
    if @product.save
---
INSERT INTO "products" ("user_id", "title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 43], ["title", "asdsa"], ["description", "ssss"], ["price", "3.0"], ["created_at", "2025-05-06 13:09:32.150655"], ["updated_at", "2025-05-06 13:09:32.150655"]]

  def edit
    @product = current_user.products.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 43], ["id", 2], ["LIMIT", 1]]

  def update
   @product = current_user.products.find_by(id: params[:id])
    if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 44], ["id", 7], ["LIMIT", 1]]
UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", "5000.0"], ["updated_at", "2025-05-07 09:55:13.644121"], ["id", 7]]

  def destroy
    @product = current_user.products.find_by(id: params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 43], ["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 4]]